<!-- Miguel Conde Luis -->
<!-- Ejercicios de autoevaluacion  -->
<!-- Ejercicio 3.2 -->

<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="UTF-8">
        <title>Ejercicio 3.2</title>
    </head>
    <body>
        <!-- Botón para regresar al index -->
        <a href="../../index.html"><label><input type="submit" name="regresar" id="menu" value="Regresar" style="font-size: 18px;"></label></a>
        <!-- ------------------------------- -->
        <h1>Ejercicio <strong>3.2</strong></h1>
        <p>Indique si cada uno de los siguientes enunciados es <em>verdadero</em> o <em>falso</em>. Si es <em>falso</em>, esplique por qué.</p>
        <br>
        
        <ol style="list-style:none ;">
            <!-- a) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">a) </strong>
                    Cualquier tipo input particular de formulario de HTML5 debe desplegarse de manera id&eacute;ntica en todos los navegadores compatibles con HTML5
                    <ul>
                        <li>
                            <mark>Falso</mark>, cada navegador muestra de formas distintas los tipos input.   
                        </li>
                    </ul>
                </p>
            </li>
            <!-- b) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">b)</strong>
                    Cuando se coloca el enfoque en el campo de texto (es decir, si el cursor est&aacute; en el campo de texto), se env&iacute;a el texto del atributo placeholder al servidor
                    <ul>
                        <li>
                            <mark>Falso</mark>, el texto en placeholder solo es visible, no tiene un valor por lo cual no se env&ia.
                        </li>
                    </ul>
                </p>
            </li>
            <!-- c) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">c)</strong>
                    No es necesario incluir el atributo autofocus en sus formulario.
                    <ul>
                        <li>
                            <mark>Verdadero.</mark>   
                        </li>
                    </ul>
                </p>
            </li>
            <!-- d) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">d)</strong>
                    Los nuevos tipos input de HTML5 tienen validaci&oacute;n autom&aacute;tica del lado del cliente, con lo cual se elimina la necesidad de agregar secuencias de comandos (script) complicadas a sus formularios para validar la entrada del usuario y se reduce la cantidad de datos inv&aacute;lidos que se env&iacute;an.
                    <ul>
                        <li>
                            <mark>Verdadero.</mark>     
                        </li>
                    </ul>
                </p>
            </li>
            <!-- e) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">e)</strong>
                    El tipo input range se valida autom&aacute;ticamente de manera intr&iacute;seca cuando el navegador lo despliega como un control deslizante, ya que el usuario no puede mover el control fuera de los l&iacute;mites del valor m&iacute;nimo o m&aacute;ximo.
                    <ul>
                        <li>
                            <mark>Verdadero.</mark>      
                        </li>
                    </ul>
                </p>
            </li>
            <!-- f) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">f)</strong>
                    HTML5 cuenta con validaci&oacute;n autom&aacute;tica para el tipo de input tel.
                    <ul>
                        <li>
                            <mark>Falso</mark>, HTML5 no cuenta con una validación autom&aacute;tica, principalmente porque la longitud de los n&uacute;meros tel&eacute;fonicos es variable en todo el mundo.   
                        </li>
                    </ul>
                </p>
            </li>
            <!-- g) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">g)</strong>
                    Si el usuario introduce un URL con un formato inapropiado en un tipo input url, no se validar&aacute;. HTML5 no valida si el URL introducido existe en realidad.
                    <ul>
                        <li>
                            <mark>Verdadero.</mark>      
                        </li>
                    </ul>
                </p>
            </li>
            <!-- h) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">h)</strong>
                    El elemento nav muestra un men&uacute; desplegable de hiperv&iacute;nculos.
                    <ul>
                        <li>
                            <mark>Falso</mark>, el elemento nav s&oacute;lo puede agrupar v&iacute;nculos.   
                        </li>
                    </ul>
                </p>
            </li>
            <!-- i) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">i)</strong>
                    El elemento header puede usarse s&oacute;lo una vez en una p&aacute;gina.
                    <ul>
                        <li>
                            <mark>Falso</mark>, el elemento header puede ser usado varias veces en una misma p&aacute;gina, en algunos casos se utiliza para encabazados o seccionar por partes el contenido de la p&aacute;gina.   
                        </li>
                    </ul>
                </p>
            </li>
            <!-- j) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">j)</strong>
                    Los elementos nav pueden anidarse en un elemento aside.
                    <ul>
                        <li>
                            <mark>Verdadero.</mark>      
                        </li>
                    </ul>
                </p>
            </li>
            <!-- k) -->
            <li>
                <p>
                    <strong style="font-size: 18px;">k)</strong>
                    Podemos usar el elemento brk para evitar dividir palabras en lugares incorrectos.
                    <ul>
                        <li>
                            <mark>Falso</mark>, el elemento correcto para este caso es wbr.    
                        </li>
                    </ul>
                </p>
            </li>     
        </ol>
    </body>
</html>